InformationRegisters/ГрафикРаботыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботыРесурсов</Name>
			<Comment>График работы ресурсов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНатуральныхЕдиниц</Name>
					<Comment>Количество занятых мест в зале, кабинете врача, болванок в станке и т. д.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НапомнитьЗа</Name>
					<Comment>Напомнить за</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ресурс1</Name>
					<Comment>Ресурс1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс2</Name>
					<Comment>Ресурс1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Ссылка на объект конфигурации прилагаемый к напоминанию</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ТестДрайв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Comment>Смена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикРаботыРесурсов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем НаборЗаписей Экспорт;		// Записан для формирования записей
Перем ДокументОбъект Экспорт;	// Документ объект для записи

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает различные значения измерений набора записей регистра в виде
// таблицы значений для регистрации изменений.
//
Функция ПолучитьПоНаборуЗаписейРазличныеЗначенияИзмерений(ЭтотОбъект) Экспорт
	
	ТипЗначенияОбъекта = ТипЗнч(ЭтотОбъект);
	МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗначенияОбъекта);

	Измерения = МетаданныеРегистра.Измерения;
	СтрокаИзмерения = "";
	
	Для Каждого ЗначениеИзмерения Из Измерения Цикл
		
		Если НЕ ЗначениеИзмерения.ОсновнойОтбор Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		СтрокаИзмерения = СтрокаИзмерения + "," + ЗначениеИзмерения.Имя;
		
	КонецЦикла;
	
	СтрокаИзмерения = Сред(СтрокаИзмерения, 2);
	ЗначенияИзмерений = ЭтотОбъект.Выгрузить();
	ЗначенияИзмерений.Свернуть(СтрокаИзмерения);
	
	Возврат ЗначенияИзмерений;
	
КонецФункции

// Формирует движения по регистру
// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция Проведение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Значение      = ДокументОбъект.Ссылка;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Использование = Истина;
	НаборЗаписейГрафикРаботыРесурсов.Прочитать();
	
	Для Каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
		СтрокаГрафикаРаботыРесурсов = НаборЗаписейГрафикРаботыРесурсов.Добавить();
		// Заполним свойства "Ресурс1,Ресурс2,Объект,Дата,НачалоРабочегоВремени,КонецРабочегоВремени,Продолжительность,КоличествоНатуральныхЕдиниц,НапомнитьЗа,Авторабота,ХозОперация,Авторабота".
		ЗаполнитьЗначенияСвойств(СтрокаГрафикаРаботыРесурсов, СтрокаНабораЗаписей);
		
		Если НЕ ЗначениеЗаполнено(СтрокаГрафикаРаботыРесурсов.ХозОперация) Тогда
			
			СтрокаГрафикаРаботыРесурсов.ХозОперация = ДокументОбъект.ХозОперация;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписейГрафикРаботыРесурсов.Записать();
	
	Возврат Ложь;
	
КонецФункции

// Удаляет движения по регистру
// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция ОтменаПроведения() Экспорт
	
	ЕстьОшибки = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Очистим регистр ГрафикРаботыРесурсов
	НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Значение = ДокументОбъект.Ссылка;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.ВидСравнения = ВидСравнения.Равно;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Использование = Истина;
	НаборЗаписейГрафикРаботыРесурсов.Прочитать();
	
	// получим значения измерений старого набора записей
	СтарыйНаборЗначенияИзмерений = ПолучитьПоНаборуЗаписейРазличныеЗначенияИзмерений(НаборЗаписейГрафикРаботыРесурсов);
	НаборЗаписейГрафикРаботыРесурсов.ДополнительныеСвойства.Вставить("ЗначенияИзмерений", СтарыйНаборЗначенияИзмерений);

	НаборЗаписейГрафикРаботыРесурсов.Очистить();
	НаборЗаписейГрафикРаботыРесурсов.Записать();
	
	Возврат ЕстьОшибки;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;

	// Регистрация изменений
	ЗначенияИзмерений = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗначенияИзмерений", ЗначенияИзмерений);
	
	Если ЗначенияИзмерений = Неопределено Тогда
		// получим значения измерений текущего набора записей
		ЗначенияИзмерений = ПолучитьПоНаборуЗаписейРазличныеЗначенияИзмерений(ЭтотОбъект);
	КонецЕсли;
	
	КонецПроцедуры 
#КонецОбласти

#КонецЕсли
